days = {1:"E",2:"F",3:"G",4:"H",5:"I",6:"J",7:"K",8:"L",9:"M",10:"N",11:"P",12:"Q",13:"R",14:"S",15:"T",16:"U",17:"V",18:"W",19:"X",20:"Y",21:"AA",22:"AB",23:"AC",24:"AD",25:"AE",26:"AF",27:"AG",28:"AH",}
month = {1:"5",2:"6",3:"7",4:"8",5:"9",6:'10',7:'11',8:'12',9:'13',10:'14',11:'15',12:'16'}

translate = {1 : """Это отличный день для решения серьезных глобальных задач и новых начинаний, для заключения сделок, проведения переговоров:  крупный проект,  совместный бизнес проект, свадьба, покупка квартиры, машины и пр. 
В этот день проявляются творческие силы, могут осенять идеи (не забывайте их записывать)
Если вы руководитель, то можно начинать глобальные проекты.
Если Вы подчиненный, то впустить в себя дух творчества, делиться идеями, мыслями с партнерами или с теми, кто может их осуществить.
Бывает, что тянет на глобальные проекты, не бояться их реализовывать!
Если вы - художник, поэт, архитектор, дизайнер, начинайте творить!
Впрочем, это справедливо не только для сугубо творческих профессий. Озарения в этот день могут постичь и бухгалтера, и химика, и водителя троллейбуса: например, как оптимизировать рабочий процесс.
В «солнечный» день хорошо просить прибавку к зарплате, так что вперед - в кабинет начальства!
Если человек занимается торговлей, то нужно этот день посвятить расширению клиентуры (звонки, реклама, и пр.)
Хорошо усваиваются новые знания, открываются новые дороги.""",
2:""""Прекрасный день для того, чтобы проявлять гибкость и дипломатию. Она будет оценена по достоинству.
То есть если вам, например, предстоят неприятные переговоры – сделайте ставку на спокойствие, четкую аргументацию, будьте готовы уступить, пусть даже для вида.
В этот день могут быть приняты неверные решения. Тянет спешить и делать лишние шаги. Могут отвлекать от дел, и Вы не сделаете, что запланировали.
- Не стоит строить глобальных планов
- Этому дню присуща двойственность: пойти – не пойти, делать – не делать.
- Отклонение от результата, т.к. двойка это процесс, а не результат.
- Легко находится общий язык с женщинами, мамой, женой (мужем).
- Могут быть провокации к спорам, но найдется компромисс.
- Лучше не спешить, не нужно провоцировать конфликты. 
- Воздержаться от покупок, если в них нет крайней необходимости
- Свадьбы не благоприятны.
- Дух сотрудничества, можно что-то просить у женщин и вам окажут услугу.
- Двойка – процесс и помощь (не материальная – личностная, психологическая), в этот день сложно отказать Вам и другим. Вежливо высказанные просьбы, скорее всего, будут удовлетворены.
- День отношений – хорошо решать вопросы, связанные с отношениями.
- Психология, кулинария, артистизм.
- Нужно продолжить то, что начала в предыдущий день, но начинать новое не надо. """,
3:"""День благоприятствует кипучей деятельности.
Вы обаятельны, остроумны, сегодня вы буквально искрите - даже если обычно не отличаетесь особой активностью. В этот день людям будет с вами интересно и их будет к вам тянуть как магнитом. Можно воспользоваться этим.
Очень благоприятно в этот день делать серьезный выбор, принимать решения. Сменить работу или остаться на прежнем месте? Поехать в отпуск на Байкал или совершить тур по европейским столицам? Сделать предложение невесте? Купить собаку (квартиру, машину)?
Также это отличный день для того, чтобы:
- завести новые, полезные в будущем знакомства,
- обрести наставника,
- заниматься интеллектуальным трудом,
- начинать обучаться чему-либо, повышать свою квалификацию, сдавать экзамены.""",
4:"""Будьте готовы к тому, что могут нарушиться планы. Сорвутся встречи, сделки, свидания. Главное - не расстраиваться и не воспринимать произошедшее как катастрофу. Да, неприятно. Но потери этого дня редко бывают фатальными. Не привязывайтесь к результату, потому что мы в этот день что-то теряем, что-то находим.
Не ввязывайтесь в авантюры. В этот день они чреваты особенно неприятными последствиями.
Уделите внимание тому, что вы говорите и пишете. Этот день очень хорош для тех, чья профессия связана с текстами: редакторы, ораторы, писатели, отчасти - педагоги и ученые. Все написанное и сказанное вами будет логично, грамотно и принесет хорошие плоды
- особенно в финансовом плане. Но воздерживайтесь от пустой болтовни! Впрочем, это для любого дня справедливо, не так ли?
«День Меркурия» хорош для поездок, для задушевных разговоров, для общения.
- Разнообразие – ключевое слово. Получайте разнообразие, общаясь в этот день с разными людьми.
- Благоприятно посещать новые места.
- Новый круг людей, общения.
- Коммуникации, юмор, подвижность. Рекомендуется общаться на возвышенные или полезные темы. Встречи, СМИ, можно набрасывать идеи о рекламе.
- Воздерживаться от споров.
- Все виды искусства, связанные с речью (говорить о творчестве, петь).""",
5:"""Будьте готовы к тому, что могут нарушиться планы. Сорвутся встречи, сделки, свидания. Главное - не расстраиваться и не воспринимать произошедшее как катастрофу. Да, неприятно. Но потери этого дня редко бывают фатальными. Не привязывайтесь к результату, потому что мы в этот день что-то теряем, что-то находим.
Не ввязывайтесь в авантюры. В этот день они чреваты особенно неприятными последствиями.
Уделите внимание тому, что вы говорите и пишете. Этот день очень хорош для тех, чья профессия связана с текстами: редакторы, ораторы, писатели, отчасти - педагоги и ученые. Все написанное и сказанное вами будет логично, грамотно и принесет хорошие плоды
- особенно в финансовом плане. Но воздерживайтесь от пустой болтовни! Впрочем, это для любого дня справедливо, не так ли?
«День Меркурия» хорош для поездок, для задушевных разговоров, для общения.
- Разнообразие – ключевое слово. Получайте разнообразие, общаясь в этот день с разными людьми.
- Благоприятно посещать новые места.
- Новый круг людей, общения.
- Коммуникации, юмор, подвижность. Рекомендуется общаться на возвышенные или полезные темы. Встречи, СМИ, можно набрасывать идеи о рекламе.
- Воздерживаться от споров.
- Все виды искусства, связанные с речью (говорить о творчестве, петь).""",
6:"""Это лучший день для того, чтобы заняться собой! Посетите салон красоты, фитнес-зал, массаж, купите себе что-нибудь приятное.
Особенно удачны будут покупки украшений для дома: картины, постеры, мебель, декоративные ткани. 
Очень хорошо в этот день пообщаться с людьми, которые вам дороги: провести время с семьей (для семейных), например, за семейным ужином, хорошо общаться с близкими – этот день дает плоды от общения. Благоприятны будут встречи с родными и друзьями, семейные посиделки, выезды на природу.
Прекрасный день для того, чтобы начать учиться, уделить время саморазвитию: пойти на курсы вождения, иностранного языка, вегетарианской кухни, служебного собаководства.
- В этот день может тянуть «налево».
- Тянет к роскоши, комфорту: СПА – салоны, салоны красоты, ароматерапия.
- Все для наслаждения 5-ти органов чувств.
- Если энергия направлена на созидание, то все по плечу.
- Благоприятны походы в гости и прием гостей.
- Хорошо заняться своим хобби, особенно если оно в сфере образования.
- Может проснуться лень, желание наслаждаться.
- Благоприятно ходить в театры, посещать выставки, смотреть фильмы на духовные темы.""",
7:"""Это день, когда следует сохранять равновесие покой. В этот день лучше оставаться в одиночестве и чем больше будет одиночества, тем лучше будет для Вас и практично для следующих дней.
Не волноваться, не ссориться, по возможности воздержаться от поездок и суеты. 
В этот день рекомендуют делать глубокие размышления, хранить покой и успокаиваться (йога, храмы, молитвы, медитации, лекции, читать духовные книги).
День для самосозерцания, бездействия или очень медленных действий. Каждый шаг должен быть тщательно обдуман.
В этот день нужно замедлить все жизненные ритмы. Чем сегодня медленнее, тем завтра практичнее.
В этот день будет тянуть к эзотерике, мистике, оккультным знаниям. Можно обратить внимание на сны могут быть вещими (с 6 на 7 день).
День не благоприятен для вкладывания денег, зарабатывать можно, поразмыслить, как вкладывать можно.
Можно также проанализировать свою деятельность за последнее время, подумать о причинах неудач и о том, как закрепить успех удачных начинаний.
Есть тяга к диагностике других, разбор гороскопов, но не консультировать в этот день.
Неблагоприятно заниматься финансовыми операциями, но могут провоцировать.""",
8:"""Зеркальное отличие от 7. День, когда не теряем ни минуты, день для материального успеха. В 8 день от рассвета до заката рекомендуется заниматься материальной деятельностью.
В этот день все ваши старания должны быть направлены на улучшение материального положения. 
Прекрасный день для банковских операций, для начала разнообразной деятельности в сфере финансов. Можно давать деньги в долг или брать ссуду, но только для развития бизнеса, а не для наслаждения.
Можно также заняться благотворительностью.
Могут быть серьезные провокации на конфликты – внимание, это проверка свыше на конфликтность. Важно не поддаваться этому настроению.
Не нужно игнорировать шансы добиться увеличения жалованья или продвижения по службе. Можно как в «1» зайти к шефу и рискнуть (выбрав оптимальное время – через 15 минут после обеда).
Не нужно ждать счастливого случая, проявите инициативу сейчас, не нужно ждать потом.
Нужно хвататься за любое деловое предложение в этот день.
«7» желательно «потупить», а в «8» действовать.
Благоприятно встретиться с глубокими философами.
Можно преуспеть также в судебных делах.
Хорошо для генеральной уборки своего трудового пространства.
Сегодня будьте особенно внимательны к людям - в первую очередь к старшему поколению. Позвоните бабушкам и дедушкам, родителям, друзьям. Но не используйте этот день для выяснения отношений (если у вас с родными есть какие-то нерешенные проблемы). Обиды будут более глубокими, чем в другие дни.""",
9:"""Это большая генеральная уборка: в квартире, на рабочем столе, в файлах компьютера... и в собственной голове.
Рекомендуется избавиться от ненужного, навести порядок во всем (в т.ч. в голове) и подготовится к новому циклу, который начнется завтра с 1-го персонифицированного дня.
В этот день необходимо отказаться от всех начинаний, отложить на завтра. Они окажутся либо бесперспективными, либо тяжелыми для достижения результата.
День хорош для поездок, творчества, подведения итогов. 
Те, кто увлекается кулинарией, в этот день могут создать подлинные шедевры и даже изобрести новые блюда. 
Неблагоприятно будет отступление от намеченных планов. Если что-то решили - в день Марса не отказывайтесь от своих намерений!
- Найти в себе силы отказаться от обременительных связей. Можно понять пользу или не пользу человека.
- Хорошо проявлять великодушие, честность, благородство. Заняться благотворительностью.
- Необходимо защищать кого-либо, заботиться о ком-то, хоть о птицах, хоть о животных (кормить их).
- В этот день корыстные люди присасываются к вам, как пиявки и тянуть из Вас, ничего не давая взамен. Нужно избегать подобных ситуаций и заграждать себя от подобных людей, если есть силы и возможности.
9-ти дневный цикл заканчивается, начинается новый, и в 1-ий день уже ничего не должно мешать.
В этот день не рекомендуется идти на компромисс, если вы уже приняли решение, то должны ему следовать.
- Хорошо делать операции, особенно если день выпал на вторник.
- Не разглашать секреты, дорожите своей и чужой репутацией, иначе в следующий цикл выйдет боком.
- Покупки не очень хороши.
- Отличен духом соревнования, но не ходьбы по головам.
- Есть шанс обогнать других, и в этот день вам будет сопутствовать победа, главное не бояться рисковать.""",}

